start_command_response = " 👋🏼! Я бот-оффициант. Нажмите на /add и напишите НОМЕР СВОЕГО СТОЛИКА ." \
"\n" \
"\n" \
"Для ознакомления со всеми функциями введите /help." \
"\n" \
"\n" \
"Также, если у вас есть жалобы/предложения разработчикам, используйте /feedback. 📝" \
"\n" \
"\n" \
"Приятного аппетита!"

order_start = "Пользователь сделал новый заказ: \n"

guide_set_timer = "Nothing written" \

help_command_response = "Доступные команды:" \
"\n" \
"\n" \
"1. /add - Добавить блюдо в вашу корзину." \
"\n" \
"2. /set_table - Выбрать номер вашего стола." \
"\n" \
"3. /delete - удалить блюдо из корзины." \
"\n" \
"4. /showorder - Показать все что в вашей корзине." \
"\n" \
"5. /clear - Очистить корзину." \
"\n" \
"6. /order - Отправить меню администратору." \
"\n" \
"7. /feedback - Отправить предложение/жалобу администрации заведения." \
"\n" \
"8. /help - Список всех доступных команд."

successfully_ordered = "Успешно отправил ваше меню администратору, приятного аппетита!"

clear_command_confirmation = "Вы уверены что хотите очистить весь ваш список блюд? 🗑"

feedback_success_command_response = "Удачно отправил ваш фидбэк всем админам 🥳"

feedback_error_command_response = "/feedback <текст>"

send_to_all_success_command_response = "Удачно отправил ваше сообщение 🥳"

admin_help_command_response = "Доступные команды для админов: " \
"\n" \
"\n" \
"1. /admin_send_to_all <текст> - Отправить <текст> всем юзерам бота." \
"\n" \
"\n" \
"2. /admin_get_distinct - Получить количество юзеров бота." \
"\n" \
"\n" \
"3. /admin_send_to <User ID> <текст> - Отправить текст определенному юзеру." \
"\n" \
"\n" \
"4. /admin_help - Список всех доступных команд для админов." \

cancelled_successfully = "Ну ладно 🙃, надеюсь еще смогу помочь вам..."

unknown_command_response = "Извините 😬, но я не знаю эту команду. Чтобы ознакомиться со всеми командами бота пропишите /help."
"\n" \

"\n" \
"\n" \

add_task_successfully_command_response = "/add <Новое блюдо>"

add_task_write_task = "Продолжайте" \
"\n" \
"\n" \
"/cancel - отменить операцию."


delete_task_write_task = "Окей, выберите блюдо которое нужно убрать 🗑:" \
"\n" \
"\n" \
"/cancel - отменить операцию."

feedback_write_text = "Окей, введите ваше предложение/жалобу ниже: 📝" \
"\n" \
"\n" \
"/cancel - отменить операцию."

delete_task_successfully_command_response = "Вы удачно удалили это блюдо 😌"

delete_task_error_command_response = "/delete <Номер блюда> - удалить определенное блюдо."

delete_task_wrong_number_command_response = "Я не нашел блюдо с таким номером 🤨"

clear_successfully_command_response = "Вы успешно очистили список вашего заказа 🥳"

tasks_empty_command_response = "Извините, но ваш список пустой 😌"

show_tasks_command_response = "Хорошо, вот ваш список блюд:\n " 


updated_tasks_command_response = "Отлично 🤗! Вот ваш обновленный список блюд:" \
"\n" \
"\n"\
"нажмите /add чтобы добавить блюдо\nнажмите /order в случае если вы готовы сделать заказ\n "




send_to_all_error_command_response = "/admin_send_to_all <Текст для отправки>"

send_to_error_command_response = "/admin_send_to <User ID> <Текст для отправки>"

choose_language_command_response = "🇷🇺Привет, для начала давай выберем язык: " \
"\n" \
"\n" \
"🇺🇸Hi, let's choose the language first:"

guide_order = "\n\nМожете отправить заказ администрации прописав /order."
